{
  "navbar": {
    "work": "works",
    "skills": "skills",
    "certificates" : "certificates",
    "about": "about",
    "contact": "contact"
  },
  "header": {
    "hello": "hello",
    "Welcome to my slice of the internet": "Welcome to my slice of the internet",
    "CSharpDeveloper": "C# DEVELOPER",
    "cancel": "cancel",
    "continue": "continue"
  },
  "content": {
    "alexanderkunze": "Alexander Kunze",
    "reactjs": "With over 17 years of experience in backend development, I am a seasoned C# developer specializing in ASP.NET, domain-driven design, and software architecture.\n\nMy expertise extends to integration testing and creating robust, scalable solutions that meet complex business requirements.\n\nI have a proven track record of delivering high-quality software solutions, leveraging my deep understanding of the .NET framework and modern development practices.\n\nI have extensive experience in developing web applications using ASP.NET Core and ASP.NET MVC. I am proficient in applying domain-driven design principles to create maintainable and scalable software architectures. My skills in designing and implementing software architectures ensure efficiency and scalability. I have expertise in writing and maintaining integration tests to ensure the reliability and performance of software applications. As a strong advocate of Agile practices, including Scrum and Kanban, I enhance team productivity and project delivery. Additionally, I am experienced in setting up and maintaining CI/CD pipelines to streamline the development process",

    "my interests": "My Interests",
    "music": "music",
    "sport": "Mountain Biking, Hiking",
    "game": "game",
    "family": "spent time with my family",
    "movie": "movie",
    "photo": "photo",
    "travel": "travel",

    "my skills": "my skills",
    "skills": "",
    "myCertificates": "My Certificates",

    "download cv": "Download CV",
    "projects": "Experience",
    "pr": "I'm a developer with experience in C#, .Net Core, TypeScript and JavaScript, and expertise in frameworks like Asp.net, React, Node.js",

    "boservice": "B & O Service AG Munich  (100% Remote)",
    "boservice-desc": "I developed advanced planning algorithms specifically designed for professional craftsmen. These algorithms utilize artificial intelligence to optimize routes, leading to significant time and cost savings. By analyzing traffic data, customer locations, and job priorities, I ensured that craftsmen could complete their tasks efficiently and on time.\n\nTo foster a flexible and iterative development environment, I applied the agile methodology ‘Scrum’. This approach allowed the team to quickly respond to changes and continuously improve. Through regular sprint planning, daily stand-up meetings, and retrospectives, we significantly enhanced team collaboration and communication.\n\nTo ensure software quality and reliability, I implemented test automation at all levels. This included end-to-end testing, unit testing, integration testing, and performance testing. By using automated testing tools and frameworks, we were able to detect and fix errors early, resulting in more stable and robust software.\n\n",

    "myexperience": "I'm C # developer with over 15 years of experience in various business areas",

    "drschnell": "Dr Schnell GmbH Munich (100% Remote)",
    "drschnell-desc": "I played a pivotal role in transitioning our development framework from the Xamarin platform to MAUI, ensuring a smooth and efficient migration.\n\nIn addition to this, I took on the responsibilities of a DevOps engineer, expertly managing and optimizing workflows within the Azure DevOps system and on the GitHub Actions platform.\n\nMy contributions also included the implementation of innovative new features, leveraging the capabilities of both the Xamarin and MAUI platforms to enhance our applications’ functionality and user experience.\n\n",

    "metrohm": "Metrohm AG Herisau (20% Remote, 80% On site)",
    "metrohm-desc": "Throughout the software development lifecycle, I spearheaded the creation of innovative applications and integration tools, seamlessly blending hardware and software components.\n\nMy efforts ensured robust and efficient solutions tailored to meet diverse needs. Additionally, I implemented comprehensive automated testing strategies at every level, significantly enhancing the reliability and performance of our systems.\n\n",

    "blum": "Julius Blum GmbH Hoechst (100% On site)",
    "blum-desc": "I was responsible for developing custom software for the production management system using technologies such as C#, MySQL, DevExpress, WinForms, ASP.Net, WCF, and various services.\n\n I analyzed and resolved issues to ensure the stable execution of tasks. Additionally, I developed prototypes using C#, XML, and SQLite. I conducted tests and analyses using a tested development pattern with C#, MSTest, and UnitTest. I also trained junior C# programmers and handled customer inquiries and troubleshooting, particularly with Gira.\n\nI coordinated the development and implementation of various applications, collaborating with project managers, customer representatives, and development teams. I assisted in the development of scalable applications and automated production facilities in the mechanical engineering industry. I utilized database functions and client applications based on MySQL, Entity Framework, C#, and VB.\n\nFurthermore, I trained apprentices in the CAD system, specifically SolidWorks and Enovia, and was primarily responsible for implementing new equipment.\n\n",

    "mia": "Mia-Systems & Software GmbH Dornbirn (20% Remote, 80% On site)",
    "mia-desc": "I developed Android applications using the Xamarin.Forms platform, which allowed me to create cross-platform mobile apps with a single codebase. In addition to my development work, I provided technical leadership for various internal projects, ensuring that they were completed efficiently and met all technical requirements.\n\nMy role also involved web development, where I utilized TypeScript and Angular to build dynamic and responsive web applications.\n\nOne of my key responsibilities was creating features within the integrated testing environment known as “Release Verification.” This often involved automating test cases to streamline the verification process and ensure the reliability of the software.\n\nFurthermore, I developed strategies for information storage and retrieval, optimizing data management and access within the projects I worked on.\n\n",

    "contact": "just say hello",

    "copy": "2024 Alexander Kunze, All rights reserved",
    "made with": "Made",
    "in erfurt": "in Erfurt"
  }
}