{
  "navbar": {
    "work": "работы",
    "skills": "навыки",
    "about": "обо мне",
    "contact": "связаться с"
  },
  "header": {
    "hello": "Здравствуйте",
    "Welcome to my slice of the internet": "Добро пожаловать в мой кусочек интернета",
    "CSharpDeveloper": "РАЗРАБОТЧИК C#",
    "cancel": "отменить",
    "continue": "продолжить"
  },
  "content": {
    "alexanderkunze": "Александр Кунце",
    "reactjs": "Я ориентированный на творчество и страстный разработчик и архитектор решений, который стремится к созданию лучших программных решений. Я работаю в среде .NET, проектирую корпоративные решения и демонстрирую знания в области распределенных систем, облачных и контейнерных технологий, а также agile-методологий.\nЯ люблю новые вызовы и регулярно ставлю перед собой новые цели для совершенствования своих знаний и навыков.",

    "my interests": "Мои интересы",
    "music": "музыка",
    "sport": "Горный велосипед, пеший туризм",
    "game": "game",
    "family": "проводил время с семьей",
    "movie": "кино",
    "photo": "фотография",
    "travel": "путешествие",

    "my skills": "мои навыки",
    "skills": "",

    "download cv": "Скачать резюме",
    "projects": "Опыт",
    "pr": "Я разработчик с опытом работы на C#, .Net Core, TypeScript и JavaScript, а также с опытом работы с такими фреймворками, как Asp.net, React, Node.js.",

    "boservice": "B & O Service AG Мюнхен (100% удаленно)",
    "boservice-desc": "Я разработал передовые алгоритмы планирования, специально предназначенные для профессиональных мастеров. Эти алгоритмы используют искусственный интеллект для оптимизации маршрутов, что приводит к значительной экономии времени и средств. Анализируя данные о дорожном движении, местонахождении клиентов и приоритетах работы, я обеспечил эффективное и своевременное выполнение задач ремесленниками.\n\nЧтобы создать гибкую и итеративную среду разработки, я применил гибкую методологию «Scrum». Этот подход позволил команде быстро реагировать на изменения и постоянно совершенствоваться. Благодаря регулярному планированию спринтов, ежедневным совещаниям и ретроспективам мы значительно улучшили взаимодействие и коммуникацию в команде.\n\nЧтобы обеспечить качество и надежность программного обеспечения, я внедрил автоматизацию тестирования на всех уровнях. Это включало сквозное тестирование, модульное тестирование, интеграционное тестирование и тестирование производительности. Благодаря использованию инструментов и фреймворков автоматизированного тестирования мы смогли обнаруживать и исправлять ошибки на ранних стадиях, что привело к созданию более стабильного и надежного программного обеспечения.\n\n",

    "myexperience": "Я C # разработчик с более чем 15-летним опытом работы в различных сферах бизнеса.",

    "drschnell": "Dr Schnell GmbH Мюнхен (100% удаленно)",
    "drschnell-desc": "Я сыграл ключевую роль в переходе нашей системы разработки с платформы Xamarin на MAUI, обеспечив плавный и эффективный переход. В дополнение к этому я взял на себя обязанности инженера DevOps, умело управляя и оптимизируя рабочие процессы в системе Azure DevOps и на платформе GitHub Actions.\n\nМой вклад также включал внедрение новых инновационных функций, используя возможности платформ Xamarin и MAUI для расширения функциональности наших приложений и улучшения пользовательского опыта.\n\n",

    "metrohm": "Metrohm AG Herisau (20% удаленно, 80% на месте)",
    "metrohm-desc": "На протяжении всего жизненного цикла разработки программного обеспечения я руководил созданием инновационных приложений и средств интеграции, органично сочетая аппаратные и программные компоненты. Мои усилия обеспечивали надежные и эффективные решения, отвечающие самым разным потребностям.\n\nКроме того, я внедрил комплексные стратегии автоматизированного тестирования на всех уровнях, что значительно повысило надежность и производительность наших систем.\n\n",

    "mia": "Mia-Systems & Software GmbH Дорнбирн (20% удаленно, 80% на месте)",
    "mia-desc": "Я разрабатывал Android-приложения с использованием платформы Xamarin.Forms, что позволило мне создавать кросс-платформенные мобильные приложения с единой кодовой базой. Помимо разработки, я осуществлял техническое руководство различными внутренними проектами, обеспечивая их эффективное завершение и соответствие всем техническим требованиям.\n\nМоя роль также включала в себя веб-разработку, где я использовал TypeScript и Angular для создания динамичных и отзывчивых веб-приложений.\n\nОдной из моих ключевых обязанностей было создание функций в интегрированной среде тестирования, известной как «Верификация релиза». Это часто включало автоматизацию тестовых ситуаций для упрощения процесса проверки и обеспечения надежности программного обеспечения. Кроме того, я разрабатывал стратегии хранения и поиска информации, оптимизируя управление данными и доступ к ним в рамках проектов, над которыми я работал.\n\n",

    "blum": "Julius Blum GmbH Hoechst (100% на местe)",
    "blum-desc": "Я отвечал за разработку пользовательского программного обеспечения для системы управления производством,\n\n используя такие технологии, как C#, MySQL, DevExpress, WinForms, ASP.Net, WCF и различные сервисы.\n\nЯ анализировал и устранял проблемы, чтобы обеспечить стабильное выполнение задач. Кроме того, я разрабатывал прототипы с использованием C#, XML и SQLite.\n\nЯ проводил тестирование и анализ, используя проверенные шаблоны разработки с C#, MSTest и UnitTest. Также я обучал младших программистов на C# и занимался обработкой запросов клиентов и устранением неполадок, особенно с Gira.\n\nЯ координировал разработку и внедрение различных приложений, сотрудничая с менеджерами проектов, представителями клиентов и командами разработчиков.\n\nЯ помогал в разработке масштабируемых приложений и автоматизировал производственные установки в машиностроительной отрасли. Я использовал функции баз данных и клиентские приложения на основе MySQL, Entity Framework, C# и VB.\n\nКроме того, я обучал стажеров работе с CAD-системами, в частности SolidWorks и Enovia, и был главным ответственным за внедрение нового оборудования.\n\n",

    "contact": "просто скажи привет",

    "copy": "2024 Александр Кунце, Все права защищены",
    "made with": "Сделано",
    "in erfurt": "в Эрфурте"
  }
}